Revit 2027 API
InitialLuminousIntensity(Double) Constructor
 Creates an initial luminous intensity object with the given document and luminosity values.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public InitialLuminousIntensity(
	double luminosity
)
Public Sub New (
	luminosity As Double
)
public:
InitialLuminousIntensity(
	double luminosity
)
new :
        luminosity : float -> InitialLuminousIntensity
Parameters
luminosity Double
 The luminosity value in cd as a numerical value between 0 and 1e+30.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The luminosity value is not valid because it is not between 0 and 1e+30.
See Also
Reference
InitialLuminousIntensity Class
InitialLuminousIntensity Overload
Autodesk.Revit.DB.Lighting Namespace